//;******************************************************************************
//;* Copyright (c) 2015 - 2017, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
//; 
//; Module Name:
//; 
//;   HotkeyStr.uni
//; 
//; Abstract:
//; 
//;   Strings for hotkey
//; 

/=#

#string STR_HOT_KEY_SHOW_HELP_PROMPT_STRING                       #language en-US  "F1"
#string STR_HOT_KEY_SHOW_HELP_HELP_STRING                         #language en-US  "Help"
                                                                  #language fr-FR  "Aide"
                                                                  #language es-ES  "Ayuda"
                                                                  #language zh-TW  "\wide說明\narrow"
                                                                  #language ja-JP  "\wideヘルプ\narrow"
                                                                  #language it-IT  "Guida"
                                                                  #language de-DE  "Hilfe"
                                                                  #language pt-PT  "Ajuda"
#string STR_HOT_KEY_DISCARD_AND_EXIT_PROMPT_STRING                #language en-US  "Esc"
#string STR_HOT_KEY_DISCARD_AND_EXIT_HELP_STRING                  #language en-US  "Exit"
                                                                  #language fr-FR  "Quitter"
                                                                  #language es-ES  "Salir"
                                                                  #language zh-TW  "\wide離開\narrow"
                                                                  #language ja-JP  "\wide終了\narrow"
                                                                  #language it-IT  "Esci"
                                                                  #language de-DE  "Ausgang"
                                                                  #language pt-PT  "Sair"
#string STR_HOT_KEY_SELECT_PREVIOUS_ITEM_PROMPT_STRING            #language en-US  "↑"
#string STR_HOT_KEY_SELECT_NEXT_ITEM_PROMPT_STRING                #language en-US  "↓"
#string STR_HOT_KEY_SELECT_ITEM_HELP_STRING                       #language en-US  "Select Item"
                                                                  #language fr-FR  "Sélect. élément"
                                                                  #language es-ES  "Selec. elemento"
                                                                  #language zh-TW  "\wide選擇項目\narrow"
                                                                  #language ja-JP  "\wideアイテム選択\narrow"
                                                                  #language it-IT  "Seleziona Voce"
                                                                  #language de-DE  "Wähle Teil"
                                                                  #language pt-PT  "Selecione item"
#string STR_HOT_KEY_SELECT_PREVIOUS_MENU_PROMPT_STRING            #language en-US  "←"
#string STR_HOT_KEY_SELECT_NEXT_MENU_PROMPT_STRING                #language en-US  "→"
#string STR_HOT_KEY_SELECT_MENU_HELP_STRING                       #language en-US  "Select Item"
                                                                  #language fr-FR  "Sélect. élément"
                                                                  #language es-ES  "Selec. elemento"
                                                                  #language zh-TW  "\wide選擇項目\narrow"
                                                                  #language ja-JP  "\wideアイテム選択\narrow"
                                                                  #language it-IT  "Seleziona Voce"
                                                                  #language de-DE  "Wähle Teil"
                                                                  #language pt-PT  "Selecione item"
#string STR_HOT_KEY_MODIFY_PREVIOUS_VALUE_PROMPT_STRING           #language en-US  "F5"
#string STR_HOT_KEY_MODIFY_PREVIOUS_VALUE_HIDDEN_KEY_PROMPT_STRING #language en-US "-"
#string STR_HOT_KEY_MODIFY_NEXT_VALUE_PROMPT_STRING               #language en-US  "F6"
#string STR_HOT_KEY_MODIFY_NEXT_VALUE_HIDDEN_KEY_PROMPT_STRING    #language en-US  "+"
#string STR_HOT_KEY_MODIFY_VALUE_HELP_STRING                      #language en-US  "Change Values"
                                                                  #language fr-FR  "Modifier les valeurs"
                                                                  #language es-ES  "Cambiar valores"
                                                                  #language zh-TW  "\wide調整數值\narrow"
                                                                  #language ja-JP  "\wide数値変更\narrow"
                                                                  #language it-IT  "Modifica Valori"
                                                                  #language de-DE  "Ändere Werte"
                                                                  #language pt-PT  "Mudar valores"
#string STR_HOT_KEY_ENTER_PROMPT_STRING                           #language en-US  "Enter"
#string STR_HOT_KEY_ENTER_HELP_STRING                             #language en-US  "Select ► SubMenu"
                                                                  #language fr-FR  "Sélectionner►Sous-menu"
                                                                  #language es-ES  "Seleccionar ► Submenú"
                                                                  #language zh-TW  "\wide選取\narrow ► \wide子功能表\narrow"
                                                                  #language ja-JP  "\wide選択\narrow ► \wideサブメニューを\narrow"
                                                                  #language it-IT  "Seleziona ► SottoMenu"
                                                                  #language de-DE  "Untermenüauswahl"
                                                                  #language pt-PT  "Selecionar ► Submenu"
#string STR_HOT_KEY_LOAD_DEFAULT_PROMPT_STRING                    #language en-US  "F9"
#string STR_HOT_KEY_LOAD_DEFAULT_HELP_STRING                      #language en-US  "Setup Defaults"
                                                                  #language fr-FR  "Définir défauts"
                                                                  #language es-ES  "Config. predet."
                                                                  #language zh-TW  "\wide預設值\narrow"
                                                                  #language ja-JP  "\wideデフォルト設定\narrow"
                                                                  #language it-IT  "Setup Defaults"
                                                                  #language de-DE  "Umgehungsabsetzung"
                                                                  #language pt-PT  "Configurar default"
#string STR_HOT_KEY_SAVE_AND_EXIT_PROMPT_STRING                   #language en-US  "F10"
#string STR_HOT_KEY_SAVE_AND_EXIT_HELP_STRING                     #language en-US  "Save and Exit"
                                                                  #language fr-FR  "Enreg. et quit."
                                                                  #language es-ES  "Guardar y salir"
                                                                  #language zh-TW  "\wide儲存並離開\narrow"
                                                                  #language ja-JP  "\wide保存\narrow&\wide終了\narrow"
                                                                  #language it-IT  "Salva ed Esci"
                                                                  #language de-DE  "Speicherung"
                                                                  #language pt-PT  "Guardar e Sair"
#string STR_HOT_KEY_SAVE_PROMPT_STRING                            #language en-US  "F10"
#string STR_HOT_KEY_SAVE_HELP_STRING                              #language en-US  "Save"
                                                                  #language fr-FR  "Save"
                                                                  #language es-ES  "Save"
                                                                  #language zh-TW  "\wide儲存\narrow"
                                                                  #language ja-JP  "\wide保存\narrow"
                                                                  #language it-IT  "Save"
                                                                  #language de-DE  "Save"
                                                                  #language pt-PT  "Save"
                                                                  
//
// Test for VfrApp
//
#string STR_VFR_APP_HOT_KEY_DISCARD_FORMSET_PROMPT_STRING                #language en-US  "F2"
#string STR_VFR_APP_HOT_KEY_DISCARD_FORMSET_HELP_STRING                  #language en-US  "Discard form set"
#string STR_VFR_APP_HOT_KEY_DISCARD_FORM_PROMPT_STRING                   #language en-US  "F3"
#string STR_VFR_APP_HOT_KEY_DISCARD_FORM_HELP_STRING                     #language en-US  "Discard form"
#string STR_VFR_APP_HOT_KEY_DISCARD_QUESTION_PROMPT_STRING               #language en-US  "F4"
#string STR_VFR_APP_HOT_KEY_DISCARD_QUESTION_HELP_STRING                 #language en-US  "Discard question"

#string STR_VFR_APP_HOT_KEY_LOAD_DEFAULT_FORMSET_PROMPT_STRING           #language en-US  "F2"
#string STR_VFR_APP_HOT_KEY_LOAD_DEFAULT_FORMSET_HELP_STRING             #language en-US  "Load form set"
#string STR_VFR_APP_HOT_KEY_LOAD_DEFAULT_FORM_PROMPT_STRING              #language en-US  "F3"
#string STR_VFR_APP_HOT_KEY_LOAD_DEFAULT_FORM_HELP_STRING                #language en-US  "Load form"
#string STR_VFR_APP_HOT_KEY_LOAD_DEFAULT_QUESTION_PROMPT_STRING          #language en-US  "F4"
#string STR_VFR_APP_HOT_KEY_LOAD_DEFAULT_QUESTION_HELP_STRING            #language en-US  "Load question"
#string STR_VFR_APP_HOT_KEY_LOAD_DEFAULT_MANUFACTURING_PROMPT_STRING     #language en-US  "F7"
#string STR_VFR_APP_HOT_KEY_LOAD_DEFAULT_MANUFACTURING_HELP_STRING       #language en-US  "Load MANUFACTURING"

#string STR_VFR_APP_HOT_KEY_SAVE_FORMSET_PROMPT_STRING            #language en-US  "F2"
#string STR_VFR_APP_HOT_KEY_SAVE_FORMSET_HELP_STRING              #language en-US  "Save form set"
#string STR_VFR_APP_HOT_KEY_SAVE_FORM_PROMPT_STRING               #language en-US  "F3"
#string STR_VFR_APP_HOT_KEY_SAVE_FORM_HELP_STRING                 #language en-US  "Save form"
#string STR_VFR_APP_HOT_KEY_SAVE_QUESTION_PROMPT_STRING           #language en-US  "F4"
#string STR_VFR_APP_HOT_KEY_SAVE_QUESTION_HELP_STRING             #language en-US  "Save question"

#string STR_VFR_APP_HOT_KEY_ENTER_CURRENT_PROMPT_STRING           #language en-US  "F2"
#string STR_VFR_APP_HOT_KEY_ENTER_CURRENT_HELP_STRING             #language en-US  "Enter Current"
#string STR_VFR_APP_HOT_KEY_ENTER_TARGET_STRING                   #language en-US  "F3"
#string STR_VFR_APP_HOT_KEY_ENTER_TARGET_HELP_STRING              #language en-US  "Enter Target"

#string STR_VFR_APP_HOT_KEY_CALLBACK_TARGET_STRING                #language en-US  "F2"
#string STR_VFR_APP_HOT_KEY_CALLBACK_TARGET_HELP_STRING           #language en-US  "Callback Target"

#string STR_VFR_APP_HOT_KEY_GOTO_PARENT_PROMPT_STRING             #language en-US  "F2"
#string STR_VFR_APP_HOT_KEY_GOTO_PARENT_HELP_STRING               #language en-US  "GoTo Parent"
#string STR_VFR_APP_HOT_KEY_GOTO_CHILD_STRING                     #language en-US  "F3"
#string STR_VFR_APP_HOT_KEY_GOTO_CHILD_HELP_STRING                #language en-US  "GoTo Child"

#string STR_VFR_APP_HOT_KEY_SET_QUESTION_VALUE_STRING             #language en-US  "F2"
#string STR_VFR_APP_HOT_KEY_SET_QUESTION_VALUE_HELP_STRING        #language en-US  "Set Q Value"

#string STR_VFR_APP_HOT_KEY_OVERRIDE_SELECT_PREVIOUS_ITEM_STRING  #language en-US  "F2"
#string STR_VFR_APP_HOT_KEY_OVERRIDE_SELECT_NEXT_ITEM_STRING      #language en-US  "F3"

#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_CTRL_A                #language en-US  "Ctrl-a"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_CTRL_F1               #language en-US  "Ctrl-F1"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_CTRL_1                #language en-US  "Ctrl-1"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_CTRL_DOT              #language en-US  "Ctrl-."
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_ALT_A                 #language en-US  "Alt-a"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_ALT_F1                #language en-US  "Alt-F1"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_ALT_1                 #language en-US  "Alt-1"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_ALT_DOT               #language en-US  "Alt-."
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_LOGO_A                #language en-US  "Logo-a"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_LOGO_F1               #language en-US  "Logo-F1"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_LOGO_1                #language en-US  "Logo-1"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_LOGO_DOT              #language en-US  "Logo-."
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_MENU_A                #language en-US  "Menu-a"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_MENU_F1               #language en-US  "Menu-F1"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_MENU_1                #language en-US  "Menu-1"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_MENU_DOT              #language en-US  "Menu-."
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_SYSREQ_A              #language en-US  "Sysreq-a"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_SYSREQ_F1             #language en-US  "Sysreq-F1"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_SYSREQ_1              #language en-US  "Sysreq-1"
#string STR_VFR_APP_HOT_KEY_COMBIND_HOT_KEY_SYSREQ_DOT            #language en-US  "Sysreq-."
